Gratitudes_Project_JS-backend/app/controllers/gratitudes_controller.rb

    def index
        gratitudes = Gratitude.all
---
SELECT "gratitudes".* FROM "gratitudes"

     def create
        gratitude = Gratitude.create(name: params[:name], description: params[:description], reason: params[:reason], user_id: params[:user_id], image: params[:image])
---
INSERT INTO "gratitudes" ("user_id", "name", "description", "reason", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def destroy
        gratitude = Gratitude.find(params[:id])
        gratitude.destroy
---
SELECT "gratitudes".* FROM "gratitudes" WHERE "gratitudes"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
DELETE FROM "gratitudes" WHERE "gratitudes"."id" = ?  [["id", 36]]