Gratitudes_Project_JS-backend/app/controllers/users_controller.rb

    def create
       user = User.find_by(name: params[:name])
        if user
            render json: user, include: [:gratitudes]
        else
            newUser = User.create(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Wyatt"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Logan"], ["created_at", "2021-02-18 02:50:57.409770"], ["updated_at", "2021-02-18 02:50:57.409770"]]